Documents/DMS_ОнлайнЗаписьВАвтосервис.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>DMS_ОнлайнЗаписьВАвтосервис</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ЧерновикиАвтомобилей</v8:Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриемкаМашиноместо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриемкаВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриемкаВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыдачаМашиноместо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыдачаВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыдачаВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подтверждена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОшибкаПланирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Длительность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Машиноместо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Нормочас</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Нормочасы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторРаботы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлительностьЗН</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDРаботы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоАкция</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DMS_СуммаБонусныхБаллов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Акция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_ЦентрализованныеАкции</v8:Type>
								<v8:Type>cfg:CatalogRef.DMS_КоммерческиеАкции</v8:Type>
								<v8:Type>cfg:CatalogRef.Renault_АкцииИСкидки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоМойка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВНаличииУКлиента</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокНаСкладе</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоАкция</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DMS_СуммаБонусныхБаллов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Акция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_ЦентрализованныеАкции</v8:Type>
								<v8:Type>cfg:CatalogRef.DMS_КоммерческиеАкции</v8:Type>
								<v8:Type>cfg:CatalogRef.Renault_АкцииИСкидки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Этапы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлительностьЭтапаПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлительностьЭтапаФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоЭтапа</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонецЭтапа</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цех</Name>
							<Type>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусЭтапа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_СтатусыАвторабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDЭтапа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоЭтапаФакт</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонецЭтапаФакт</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/CRM_ПервичныйПовторный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>CRM_ПервичныйПовторный</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Первичный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Повторный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/DMS_ОнлайнЗаписьВАвтосервис/Ext/ObjectModule.bsl
Процедура ЗаполнитьДокументОнлайнДанными(СтруктураДанных) Экспорт 
	
	Подтверждена = Ложь;
	Дата = ТекущаяДата();
	ДилерскийЦентр = Справочники.CRM_ДилерскиеЦентры.НайтиПоРеквизиту("Бир_ЛМТ",СтруктураДанных.to);
	Автор = ПараметрыСеанса.Пользователь;
	
	ОбщиеДанные = СтруктураДанных.data;
	//Пока закоментим
	//ДанныеКлиента = Новый Структура;
	//ДанныеКлиента.Вставить("Фамилия",ОбщиеДанные.LastName);
	//ДанныеКлиента.Вставить("Имя",ОбщиеДанные.FirstName);
	//ДанныеКлиента.Вставить("Отчество",ОбщиеДанные.MiddleName);
	//ДанныеКлиента.Вставить("Почта",ОбщиеДанные.Email);
	//ДанныеКлиента.Вставить("Телефон",СтрЗаменить(ОбщиеДанные.Telephone,"+",""));
	
	Клиент = ВернутьКлиентаДляРезерва();
	Автомобиль = ВернутьАвтомобильДляРезерва();
	//Пока закоментим так же
	//ДанныеАвтомобиля = Новый Структура;
	//ДанныеАвтомобиля.Вставить("Кондиционер",ОбщиеДанные.ModelDesc.AirConditioner);
	//ДанныеАвтомобиля.Вставить("СалонныйФильтр",ОбщиеДанные.ModelDesc.CabinFilter);
	//ДанныеАвтомобиля.Вставить("Модель",Справочники.Модели.НайтиПоРеквизиту("Артикул",ОбщиеДанные.ModelDesc.ModelCode));
	//ДанныеАвтомобиля.Вставить("Пробег",ОбщиеДанные.Odometer);
	//ДанныеАвтомобиля.Вставить("VIN",ОбщиеДанные.VIN);
	//ДанныеАвтомобиля.Вставить("ГУР","");
	//ДанныеАвтомобиля.Вставить("Хозяин",Клиент);
	//Автомобиль = НайтиСоздатьАвтомобиль(ДанныеАвтомобиля);          
	
	МассивРабот = Новый Массив;
	Для Каждого Элем Из ОбщиеДанные.ComplexList Цикл
		МассивРабот.Добавить(Справочники.Renault_КомплексСервисыАвторабот.НайтиПоРеквизиту("Артикул",Элем.ComplexID));
	КонецЦикла;
	
	СтруктураРабот = ПолучитьСтруктуруТаблицПоКС(МассивРабот,ДилерскийЦентр);
	
	НачалоРабот = ПрочитатьДатуJSON(ОбщиеДанные.StartTime,ФорматДатыJSON.ISO);
	СотрудникИсполнитель = Справочники.Сотрудники.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбщиеДанные.SlotID));
	
	Если Не ЗначениеЗаполнено(СотрудникИсполнитель.код) Тогда 
		ВызватьИсключение("Не найден сотрудник для записи");
	КонецЕсли;
	ПриемкаМашиноместо = СотрудникИсполнитель;
	ВыдачаМашиноместо = ПриемкаМашиноместо;
	
	ДлительностьПриемки = ДилерскийЦентр.ДлительностьПриемки/60;
	ДлительностьВыдачи = ДилерскийЦентр.ДлительностьВыдачи/60;
	//Получим данные по планированию
	ПараметрыОбращения = Новый Структура;
	ПараметрыОбращения.Вставить("ДилерскийЦентр",ДилерскийЦентр);
	ПараметрыОбращения.Вставить("Клиент",Клиент);
	ПараметрыОбращения.Вставить("ВидОбращения",Справочники.Renault_ВидыОбращенийВАвтосервис.ОнлайнЗапись);
	ПараметрыОбращения.Вставить("Примечание",Комментарий);
	ПараметрыОбращения.Вставить("ТекущийАвтомобиль",Автомобиль);
	ПараметрыОбращения.Вставить("Автор",ПараметрыСеанса.Пользователь);
	ПараметрыОбращения.Вставить("Онлайн",Ссылка);
	НачатьТранзакцию();
	Обращение = СоздатьОбращение(ПараметрыОбращения);
	ПараметрыПланирования = Новый Структура;
	ПараметрыПланирования.Вставить("ДилерскийЦентр",ДилерскийЦентр);
	ПараметрыПланирования.Вставить("ОбращениеСсылка",Обращение.Ссылка);
	ПараметрыПланирования.Вставить("Автор",Автор);
	ПараметрыПланирования.Вставить("Клиент",Клиент);
	ПараметрыПланирования.Вставить("ВладелецАвтомобиля",Клиент);
	ПараметрыПланирования.Вставить("Автоработы",СтруктураРабот.Работы);
	ПараметрыПланирования.Вставить("ТаблицаМатериалы",СтруктураРабот.Запчасти);
	ПараметрыПланирования.Вставить("ИсполнительЦех",СотрудникИсполнитель);
	ПараметрыПланирования.Вставить("ВремяНачала",НачалоРабот);
	ПараметрыПланирования.Вставить("ДлительностьПриемки",ДлительностьПриемки);
	ПараметрыПланирования.Вставить("ДлительностьВыдачи",ДлительностьВыдачи);
	ПараметрыПланирования.Вставить("ВидРемонта",ДилерскийЦентр.Автосервис_ВидРемонтаПоУмолчанию);
	ПараметрыПланирования.Вставить("Нормочас",ДилерскийЦентр.Автосервис_Нормочас);
	ПараметрыПланирования.Вставить("ТипЦен",ДилерскийЦентр.Автосервис_ТипЦенПродажи);
	Планирование = ПолучитьДанныеПоПланированию(ПараметрыПланирования);
	ЗаполнитьДокументПланированием(Планирование);	
	ОтменитьТранзакцию();
	
	ПроверитьПустыеРаботы();     
	
	// Беседин 23.11.21 заявка 1373 логирование ошибок
	Попытка
		Записать();
	Исключение
		ЗаписьЖурналаРегистрации("ОнлайнЗапись", УровеньЖурналаРегистрации.Ошибка, "Документ.ОнлайнЗаписьВАвтосервис",
				СокрЛП(Клиент) + " " + СокрЛП(Автомобиль), ОписаниеОшибки());			
	КонецПопытки;

КонецПроцедуры

Процедура ПроверитьПустыеРаботы()
	
	Для Каждого Этап Из Этапы Цикл 
		Если Этап.НачалоЭтапа = Этап.КонецЭтапа Тогда 
			ВызватьИсключение("Не найдено слотов под онлайн запись");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСтруктуруТаблицПоКС(МассивКС,ДилерскийЦентр)
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Работа");
	Результат.Колонки.Добавить("Номенклатура");
	Результат.Колонки.Добавить("Нормочас");
	Результат.Колонки.Добавить("Цена",Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10,2)));
	Результат.Колонки.Добавить("Количество");
	Результат.Колонки.Добавить("ДлительностьЗН");
	Результат.Колонки.Добавить("Длительность");
	Результат.Колонки.Добавить("Стоимость",Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(10,2)));

	
	ОбработкаКС = Обработки.Renault_ПодборКомплексСервисов.Создать();
	ТабАвтоработы = Работы;
	ТабЗапчасти = Товары;
	
	СуммаРабот = 0;
	Для Каждого Элем Из МассивКС Цикл
		Результат.Очистить();
		Данные = ОбработкаКС.ЗаполнитьСоставПоКомплексу(Элем,Результат,ДилерскийЦентр);
		
		Для каждого ТекСтрока из Данные Цикл
			Если ЗначениеЗаполнено(ТекСтрока.Работа) Тогда
				СуммаРабот = ТекСтрока.Цена;
				
				НоваяСтрокаРабота = ТабАвтоработы.Добавить();
				НоваяСтрокаРабота.Коэффициент = ПолучитьКоэффициентСложностиРаботы(ТекСтрока.Работа, ДилерскийЦентр.Автосервис_ВидРемонтаПоУмолчанию);
				ЗаполнитьЗначенияСвойств(НоваяСтрокаРабота, ТекСтрока);
				НоваяСтрокаРабота.Нормочас = ДилерскийЦентр.Автосервис_Нормочас;
				//+++Уберем ошибку с делением на 0
				Если НоваяСтрокаРабота.Длительность <> 0 Тогда
					НоваяСтрокаРабота.Цена = НоваяСтрокаРабота.Сумма / НоваяСтрокаРабота.Длительность;
				КонецЕсли;
				//
				НоваяСтрокаРабота.Сумма = ТекСтрока.Стоимость;
			ИначеЕсли ЗначениеЗаполнено(ТекСтрока.Номенклатура) Тогда
				НоваяСтрока = ТабЗапчасти.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
				НоваяСтрока.Сумма = ТекСтрока.Стоимость;
				
			//DMSREN-975+
				НоваяСтрока.Цена = обПолучитьЦену(ДилерскийЦентр.Автосервис_ТипЦенПродажи, ТекСтрока.Номенклатура,,,,,,,ПараметрыСеанса.ПодразделениеКомпании); // DMSREN-1053
				НоваяСтрока.Сумма = НоваяСтрока.Цена * НоваяСтрока.Количество;
				СуммаРабот = СуммаРабот - НоваяСтрока.Сумма;
				
				//DMSREN-1006 -> DMSREN-1177
				//ОстатокНаСкладе = Renault_АвтосервисОбщий.Renault_ПроверитьОстатокНаСкладе(ТекСтрока.Номенклатура, ДилерскийЦентр.Автосервис_СкладПоУмолчанию);
				//Если НоваяСтрока.Количество>ОстатокНаСкладе Тогда 
				//	ВызватьИсключение("На складе нет необходимого количества "+ТекСтрока.Номенклатура);
				//КонецЕсли;
				//---
			КонецЕсли;
			
			Если НоваяСтрокаРабота.Длительность <> 0 Тогда
				НоваяСтрокаРабота.Цена = СуммаРабот / НоваяСтрокаРабота.Длительность;
			КонецЕсли;
			НоваяСтрокаРабота.Сумма = СуммаРабот;
			//DMSREN-975-	
		КонецЦикла;
	КонецЦикла;

	Возврат Новый Структура("Работы,Запчасти",ТабАвтоработы,ТабЗапчасти);
	
КонецФункции

Функция СоздатьОбращение(ПараметрыОбращения) Экспорт
	
	Обращение = Документы.Renault_CRM_ОбращениеВАвтоСервис.СоздатьДокумент();
	Обращение.Дата					= ТекущаяДата();
	Обращение.ДилерскийЦентр 		= ПараметрыОбращения.ДилерскийЦентр;
	
	Обращение.Клиент 				= ПараметрыОбращения.Клиент;
	Обращение.ВидОбращения 			= ПараметрыОбращения.ВидОбращения;
	Обращение.Примечание 			= ПараметрыОбращения.Примечание;
	Обращение.Автомобиль 			= ПараметрыОбращения.ТекущийАвтомобиль;
	Обращение.Автор					= ПараметрыОбращения.Автор;
	Обращение.ХозОперация 			= Справочники.ХозОперации.ПрочиеДокументы;
	Обращение.ПервичныйПовторный	= Перечисления.CRM_ПервичныйПовторный.Первичный;
	Обращение.ДокументОнлайнЗаписи	= ПараметрыОбращения.Онлайн;
	Обращение.ОбращениеОбработано	= Истина;
	Обращение.ПроверенВICM			= Ложь;
	
	Попытка	
		Обращение.Записать(РежимЗаписиДокумента.Запись);		
		ОбращениеСсылка = Обращение.Ссылка;
	Исключение
		
	КонецПопытки; 	
	
	Возврат Обращение;
КонецФункции

Функция НайтиСоздатьКлиента(ПараметрыКлиента)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КонтактнаяИнформация.Объект КАК Клиент,
		|	КонтактнаяИнформация.Тип КАК Тип,
		|	КонтактнаяИнформация.Вид КАК Вид,
		|	КонтактнаяИнформация.Представление КАК представление
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Представление ПОДОБНО &телефон
		|	И (ТИПЗНАЧЕНИЯ(КонтактнаяИнформация.Объект) = ТИП(справочник.CRM_ПотенциальныеКонтрагенты)
		|			ИЛИ ТИПЗНАЧЕНИЯ(КонтактнаяИнформация.Объект) = ТИП(справочник.Контрагенты))";
	
	Запрос.УстановитьПараметр("телефон", ПараметрыКлиента.Телефон);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Клиент;
	КонецЦикла;

	//если в базе нету, то создадим потенциального клиента
	НовыйКонтрагент = Справочники.CRM_ПотенциальныеКонтрагенты.СоздатьЭлемент();
	НовыйКонтрагент.Фамилия = ПараметрыКлиента.Фамилия;	
	НовыйКонтрагент.Имя = ПараметрыКлиента.Имя; 
	НовыйКонтрагент.ФормаСобственности = перечисления.ФормыСобственности.ЧастноеЛицо;
	НовыйКонтрагент.Наименование = СокрЛП(НовыйКонтрагент.Фамилия) + ?(ПустаяСтрока(СокрЛП(НовыйКонтрагент.Имя)),""," " + СокрЛП(НовыйКонтрагент.Имя)) + ?(ПустаяСтрока(СокрЛП(НовыйКонтрагент.Отчество)),""," " + СокрЛП(НовыйКонтрагент.Отчество));
	
	Если ПустаяСтрока(НовыйКонтрагент.НаименованиеПолное) Тогда
		НовыйКонтрагент.НаименованиеПолное = СокрЛП(НовыйКонтрагент.Наименование);
	КонецЕсли; 

	
	НовыйКонтрагент.Записать();
	
	Менеджер = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	Менеджер.Объект = НовыйКонтрагент.Ссылка;
	Менеджер.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	Менеджер.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонСотовый;
	Если ЗначениеЗаполнено(ПараметрыКлиента.Телефон) Тогда
		Менеджер.Представление = ПараметрыКлиента.Телефон;
		Менеджер.ЗначениеПоУмолчанию = Истина;
		Менеджер.Записать(Истина);
	Иначе
		Менеджер.Удалить();
	КонецЕсли;

	Менеджер = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	Менеджер.Объект = НовыйКонтрагент.Ссылка;
	Менеджер.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	Менеджер.Вид = Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний;
	Если ЗначениеЗаполнено(ПараметрыКлиента.Почта) Тогда
		Менеджер.Представление = ПараметрыКлиента.Почта;
		Менеджер.ЗначениеПоУмолчанию = Истина;
		Менеджер.Записать(Истина);
	Иначе
		Менеджер.Удалить();
	КонецЕсли;
	
	Возврат НовыйКонтрагент.Ссылка;
	
КонецФункции

//Будем возвращать любого клиента для того чтобы спланировать время записи
Функция ВернутьКлиентаДляРезерва()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
	КонецЦикла;
	Возврат ВыборкаДетальныеЗаписи.Ссылка;	
	
КонецФункции

//Будем возвращать любой автомобиль для того чтобы спланировать время записи
Функция ВернутьАвтомобильДляРезерва()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Автомобили.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Автомобили КАК Автомобили
		|ГДЕ
		|	Автомобили.Модель <> ЗНАЧЕНИЕ(Справочник.Модели.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
	КонецЦикла;
	Возврат ВыборкаДетальныеЗаписи.Ссылка;	
	
КонецФункции

Функция НайтиСоздатьАвтомобиль(ПараметрыАвтомобиля)
	
	Если ЗначениеЗаполнено(ПараметрыАвтомобиля.VIN) Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Автомобили.Ссылка КАК Ссылка,
		|	1 КАК Приоритет
		|ИЗ
		|	Справочник.Автомобили КАК Автомобили
		|ГДЕ
		|	Автомобили.VIN ПОДОБНО &VIN
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Renault_ЧерновикиАвтомобилей.Ссылка,
		|	2
		|ИЗ
		|	Справочник.Renault_ЧерновикиАвтомобилей КАК Renault_ЧерновикиАвтомобилей
		|ГДЕ
		|	Renault_ЧерновикиАвтомобилей.VIN ПОДОБНО &VIN
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет";
		
		Запрос.УстановитьПараметр("VIN", ПараметрыАвтомобиля.VIN);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Возврат ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;

	КонецЕсли;
	
	НовыйАвто = Справочники.Renault_ЧерновикиАвтомобилей.СоздатьЭлемент();
	НовыйАвто.VIN = ПараметрыАвтомобиля.VIN;
	НовыйАвто.Хозяин = ПараметрыАвтомобиля.Хозяин;
	НовыйАвто.Модель = ПараметрыАвтомобиля.Модель;
	НовыйАвто.ФормированиеНаименованияЧерновикаАвтомобиля("");
	НовыйАвто.Наименование = НовыйАвто.Наименование + "(черновик)";
	НовыйАвто.Записать();
	Возврат НовыйАвто.Ссылка;
		
КонецФункции

Функция ПолучитьДанныеПоПланированию(ПараметрыПланирования)
	ОбработкаАвтосервис = Обработки.CRM_АРМ_АвтоСервис_4.Создать();
	ОбработкаАвтосервис.ДилерскийЦентр = ПараметрыПланирования.ДилерскийЦентр;
	ДанныеОРаботах = Новый Структура;
	ДанныеОРаботах.Вставить("Обращение", ПараметрыПланирования.ОбращениеСсылка);
	ДанныеОРаботах.Вставить("Автор", ПараметрыПланирования.Автор);
	ДанныеОРаботах.Вставить("Клиент", ПараметрыПланирования.Клиент);
	ДанныеОРаботах.Вставить("Владелец", ПараметрыПланирования.ВладелецАвтомобиля);
	ДанныеОРаботах.Вставить("КлиентОтличаетсяОтВладельца", Ложь);
	ДанныеОРаботах.Вставить("ПланироватьРаботу", Истина);
	ДанныеОРаботах.Вставить("ПланироватьПриемкуВыдачу", Истина);
	ДанныеОРаботах.Вставить("Автоработы", ПараметрыПланирования.Автоработы);
	ДанныеОРаботах.Вставить("Запчасти", ПараметрыПланирования.ТаблицаМатериалы);
	ДанныеОРаботах.Вставить("ИсполнительЦех", ПараметрыПланирования.ИсполнительЦех);
	ДанныеОРаботах.Вставить("ВремяНачала", ПараметрыПланирования.ВремяНачала);
	ДанныеОРаботах.Вставить("ВтораяЗаявка", Неопределено);
	ДанныеОРаботах.Вставить("ТретьяЗаявка", Неопределено);
	ДанныеОРаботах.Вставить("ЧетвертаяЗаявка", Неопределено);
	ДанныеОРаботах.Вставить("ЗапчастиВторая", Неопределено);
	ДанныеОРаботах.Вставить("ЗапчастиТретья", Неопределено);
	ДанныеОРаботах.Вставить("ЗапчастиЧетвертая", Неопределено);
	ДанныеОРаботах.Вставить("ПланироватьВыдачуНаПриемщика", Истина);
	ДанныеОРаботах.Вставить("ДлительностьПриемки", ПараметрыПланирования.ДлительностьПриемки);
	ДанныеОРаботах.Вставить("ДлительностьВыдачи", ПараметрыПланирования.ДлительностьВыдачи);
	ДанныеОРаботах.Вставить("СРазбивкойНаЭтапы", Истина);
	ДанныеОРаботах.Вставить("НеПланироватьВторуюЗаявку", Истина);
	ДанныеОРаботах.Вставить("НеПланироватьТретьюЗаявку", Истина);
	ДанныеОРаботах.Вставить("НеПланироватьЧетвертуюЗаявку", Истина);
	ДанныеОРаботах.Вставить("ВидРемонта1", ПараметрыПланирования.ВидРемонта);
	ДанныеОРаботах.Вставить("Нормочас1", ПараметрыПланирования.Нормочас);
	ДанныеОРаботах.Вставить("ТипЦен1", ПараметрыПланирования.ТипЦен);
	ДанныеОРаботах.Вставить("ВидРемонта2", Неопределено);
	ДанныеОРаботах.Вставить("Нормочас2", Неопределено);
	ДанныеОРаботах.Вставить("ТипЦен2", Неопределено);
	ДанныеОРаботах.Вставить("ВидРемонта3", Неопределено);
	ДанныеОРаботах.Вставить("Нормочас3", Неопределено);
	ДанныеОРаботах.Вставить("ТипЦен3", Неопределено);
	ДанныеОРаботах.Вставить("ВидРемонта4", Неопределено);
	ДанныеОРаботах.Вставить("Нормочас4", Неопределено);
	ДанныеОРаботах.Вставить("ТипЦен4", Неопределено);
	ДанныеОРаботах.Вставить("ТолькоРаботающие", Ложь);
	
	СозданныйРабочийДокумент = Неопределено;
	СозданныеДокументы = Неопределено;
	ОбработкаАвтосервис.ЗапланироватьРаботы(ДанныеОРаботах, СозданныйРабочийДокумент,СозданныеДокументы,Истина);
	
	Возврат СозданныеДокументы;	
	
КонецФункции

Функция ПолучитьКоэффициентСложностиРаботы(Авторабота, ВидРемонта = Неопределено)
	
	Если ЗначениеЗаполнено(ВидРемонта) Тогда
		
		Гарантия = РегистрыСведений.Renault_ВидыРемонтаДопРеквизиты.ПолучитьГарантиюЗавода(ВидРемонта);
		
		Если Гарантия = Истина Тогда
			
			Возврат 1;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Коэффициент = 1;
	
	Если НЕ ЗначениеЗаполнено(Авторабота.Артикул) Тогда
		Возврат Коэффициент;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Справочник.Коэффициент
	|ИЗ
	|	РегистрСведений.OPERACODE_НормыРабот.СрезПоследних(&Период, КодПоКаталогу = &Артикул) КАК OPERACODE_НормыРаботСрезПоследних
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Renault_КоэффициентыСложностиРабот КАК Справочник
	|ПО Справочник.СложностьРабот = OPERACODE_НормыРаботСрезПоследних.СложностьРабот";
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Запрос.УстановитьПараметр("Артикул", Авторабота.Артикул);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Коэффициент = Выборка.Коэффициент;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Коэффициент) Тогда
		
		Возврат Коэффициент;
		
	Иначе
		
		Возврат 1;
		
	КонецЕсли;
	
КонецФункции

Процедура ЗаполнитьДокументПланированием(Планирование)
	
	Приемка = Планирование.Приемка;
	Заявка = Планирование.Заявка;
	Выдача = Планирование.Выдача;
	
	ПриемкаВремяНачала = Приемка.ВремяНачала;
	ВыдачаВремяНачала  = Выдача.ВремяНачала;
	ПриемкаВремяОкончания = Приемка.ВремяОкончания;
	ВыдачаВремяОкончания = Выдача.ВремяОкончания;
	Работы.Загрузить(Заявка.Работы.Выгрузить());
	Товары.Загрузить(Заявка.Товары.Выгрузить());
	Этапы.Загрузить(Заявка.Этапы.Выгрузить());
	
КонецПроцедуры

Процедура ЗапланироватьДаннымиДокумента(СтруктураДанных) Экспорт 
	
	ОбщиеДанные = СтруктураДанных.data;
	
	НачатьТранзакцию();
	
	ОбработкаАвтосервис = Обработки.CRM_АРМ_АвтоСервис_4.Создать();
	ОбработкаАвтосервис.ДилерскийЦентр = ДилерскийЦентр;

	СтруктураПриемки = Новый Структура;
	СтруктураПриемки.Вставить("Исполнитель",ПриемкаМашиноместо);
	СтруктураПриемки.Вставить("ВремяНачала",ПриемкаВремяНачала);
	СтруктураПриемки.Вставить("ВремяОкончания",ПриемкаВремяОкончания);
	Ошибка = ОбработкаАвтосервис.ПроверитьВремяПриемки(СтруктураПриемки);
	
	Если Ошибка Тогда
		СообщениеОшибки = "Время приемки занято";
		ОтменитьТранзакцию();
		ВызватьИсключение(СообщениеОшибки);	
	КонецЕсли;

	Комментарий =  ОбщиеДанные.Comment+Символы.ПС+ОбщиеДанные.CommentPrice;
	
	ДанныеКлиента = Новый Структура;
	ДанныеКлиента.Вставить("Фамилия",ОбщиеДанные.LastName);
	ДанныеКлиента.Вставить("Имя",ОбщиеДанные.FirstName);
	ДанныеКлиента.Вставить("Почта",ОбщиеДанные.Email);
	ДанныеКлиента.Вставить("Телефон",ОбщиеДанные.Telephone);
	Клиент = НайтиСоздатьКлиента(ДанныеКлиента);

	ДанныеАвтомобиля = Новый Структура;
	ДанныеАвтомобиля.Вставить("Кондиционер",ОбщиеДанные.ModelDesc.AirConditioner);
	ДанныеАвтомобиля.Вставить("Модель",Справочники.Модели.НайтиПоРеквизиту("Артикул",ОбщиеДанные.ModelDesc.ModelCode));
	ДанныеАвтомобиля.Вставить("Пробег",ОбщиеДанные.ModelDesc.Odometer);
	ДанныеАвтомобиля.Вставить("VIN",ОбщиеДанные.ModelDesc.VIN);
	ДанныеАвтомобиля.Вставить("ГУР","");
	ДанныеАвтомобиля.Вставить("Хозяин",Клиент);
	Автомобиль = НайтиСоздатьАвтомобиль(ДанныеАвтомобиля);          	
	
	ПараметрыОбращения = Новый Структура;
	ПараметрыОбращения.Вставить("ДилерскийЦентр",ДилерскийЦентр);
	ПараметрыОбращения.Вставить("Клиент",Клиент);
	ПараметрыОбращения.Вставить("ВидОбращения",Справочники.Renault_ВидыОбращенийВАвтосервис.ОнлайнЗапись);
	ПараметрыОбращения.Вставить("Примечание",Комментарий);
	ПараметрыОбращения.Вставить("ТекущийАвтомобиль",Автомобиль);
	ПараметрыОбращения.Вставить("Автор",ПараметрыСеанса.Пользователь);
	ПараметрыОбращения.Вставить("Онлайн",Ссылка);
	Обращение = СоздатьОбращение(ПараметрыОбращения);

	
	ПараметрыПланирования = Новый Структура;
	ПараметрыПланирования.Вставить("ДилерскийЦентр",ДилерскийЦентр);
	ПараметрыПланирования.Вставить("ОбращениеСсылка",Обращение.Ссылка);
	ПараметрыПланирования.Вставить("Автор",Автор);
	ПараметрыПланирования.Вставить("Клиент",Клиент);
	ПараметрыПланирования.Вставить("ВладелецАвтомобиля",Клиент);
	ПараметрыПланирования.Вставить("Автоработы",Работы);
	ПараметрыПланирования.Вставить("ТаблицаМатериалы",Товары);
	ПараметрыПланирования.Вставить("ИсполнительЦех",ПриемкаМашиноместо);
	ПараметрыПланирования.Вставить("ВремяНачала",ПриемкаВремяНачала);
	ПараметрыПланирования.Вставить("ДлительностьПриемки",ДилерскийЦентр.ДлительностьПриемки/60);
	ПараметрыПланирования.Вставить("ДлительностьВыдачи",ДилерскийЦентр.ДлительностьВыдачи/60);
	ПараметрыПланирования.Вставить("ВидРемонта",ДилерскийЦентр.Автосервис_ВидРемонтаПоУмолчанию);
	ПараметрыПланирования.Вставить("Нормочас",ДилерскийЦентр.Автосервис_Нормочас);
	ПараметрыПланирования.Вставить("ТипЦен",ДилерскийЦентр.Автосервис_ТипЦенПродажи);
	Планирование = ПолучитьДанныеПоПланированию(ПараметрыПланирования);
	
	Ошибка = ПроверитьДанныеСДокументом(Планирование);
	
	Если Не Ошибка Тогда
		Подтверждена = Истина;		
		ЗафиксироватьТранзакцию();
	Иначе 
		ОтменитьТранзакцию();
	КонецЕсли;
	
	// Беседин 23.11.21 заявка 1373 логирование в журнал
	Попытка
		Записать();
	Исключение
		ЗаписьЖурналаРегистрации("ОнлайнЗапись", УровеньЖурналаРегистрации.Ошибка, ЭтотОбъект.Метаданные(),
				СокрЛП(Клиент) + "  " + СокрЛП(Автомобиль), "Невозможно запланировать данными документа");	
	КонецПопытки;
	
КонецПроцедуры

Функция ПроверитьДанныеСДокументом(Планирование)
	
	ЕстьОшибки = Ложь;
	СообщениеОшибки = "";
		
	Приемка = Планирование.Приемка;
	Заявка = Планирование.Заявка;
	Выдача = Планирование.Выдача;
	
	ПриемкаВремяНачала = Приемка.ВремяНачала;
	ВыдачаВремяНачала  = Выдача.ВремяНачала;
	ПриемкаВремяОкончания = Приемка.ВремяОкончания;
	ВыдачаВремяОкончания = Выдача.ВремяОкончания;
	Работы.Загрузить(Заявка.Работы.Выгрузить());
	Товары.Загрузить(Заявка.Товары.Выгрузить());
	Этапы.Загрузить(Заявка.Этапы.Выгрузить());
	

	
	Если ВыдачаВремяНачала <>  Выдача.ВремяНачала или ВыдачаВремяОкончания <> Выдача.ВремяОкончания Тогда 
		ЕстьОшибки = Истина;
		СообщениеОшибки = "Не совпадает время выдачи автомобиля";
	КонецЕсли;
	
	Если Этапы.Количество() <> Заявка.Этапы.Количество() Тогда 
		ЕстьОшибки = Истина;
		СообщениеОшибки = "Отличается количество этапов работ";
	Иначе
		Индекс = 0;
		Пока Индекс < Этапы.Количество() цикл 
			СтрокаЭтапа = Этапы[Индекс];
			СтрокаЭтапаНовый = Заявка.Этапы[Индекс];
			Если СтрокаЭтапа.НачалоЭтапа <> СтрокаЭтапаНовый.НачалоЭтапа
				Или СтрокаЭтапа.КонецЭтапа <> СтрокаЭтапаНовый.КонецЭтапа
				Или СтрокаЭтапа.Цех <> СтрокаЭтапаНовый.Цех Тогда 
				ЕстьОшибки = Истина;
				СообщениеОшибки = "Не совпадают данные по работам";
				Прервать;
			КонецЕсли;
			Индекс = Индекс + 1;				
		КонецЦикла;
	КонецЕсли;
	ОшибкаПланирования = СообщениеОшибки;
	Возврат ЕстьОшибки;	
	
КонецФункции
